{
    "Title": "Echoes of the Forgotten",
    "Credits": "Created by Andrea Castillo (anbcasti@ucsc.edu).",
    "InitialLocation": "Foyer",
    "Locations": {
        "Foyer": {
            "Body": "<br>The Foyer: The grand foyer sets the tone with its dusty chandeliers and faded portraits lining the walls.",
            "Choices": [
                {
                    "Text": "Follow the path away from house.",
                    "Target": "Garden"
                },
                {
                    "Text": "Go inside the house.",
                    "Target": "Grand Hall"
                }
            ]
        },
        "Grand Hall": {
            "Body": "<br>The Grand Hall: Main enterance of the house.<br>Lined with paintings, filled with history.",
            "Choices": [
                {
                    "Text": "Go left.",
                    "Target": "Library"
                },
                {
                    "Text": "Go right.",
                    "Target": "Dining Hall"
                },
                {
                    "Text": "Go outside the house.",
                    "Target": "Foyer"
                }
            ],
            "GrandHallMechanism": true,
            "BlockedHall": true
        },
        "Library": {
            "Body": "<br>The Library: A vast library filled with dusty tomes and creaky shelves.<br>These books haven't been touched in ages.",
            "Choices": [
                {
                    "Text": "Go left.",
                    "Target": "Study"
                },
                {
                    "Text": "Go right.",
                    "Target": "Grand Hall"
                }
            ],
            "LibraryMechanism":true
        },
        "Study": {
            "Body": "<br>The Study: A cluttered study with papers strewn across the desk.<br>Hunting weapons displayed all around the walls.",
            "Choices": [
                {
                    "Text": "Go right.",
                    "Target": "Library"
                }
            ],
            "StudyMechanism": true,
            "BlockedStudy": true
        },
        "Conservatory": {
            "Body": "<br>The Conservatory: A serene space with overgrown foliage and broken glass panes.",
            "Choices": [
                {
                    "Text": "Take the glass door out.",
                    "Target": "Garden"
                }
            ],
            "ConservatoryMechanism": true,
            "BlockedConv": true
        },
        "Attic": {
            "Body": "<br>The Attic: A dimly lit space filled with forgotten belongings.",
            "Choices": [
                {
                    "Text": "Use the dusty shute.",
                    "Target": "Bedroom"
                }
            ]
        },
        "Bedroom": {
            "Body": "<br>The Bedroom: A once opulent bedroom now draped in cobwebs.<br>Toys still line wall by the bed.<br>Must have been a child's room.",
            "Choices": [
                {
                    "Text": "Go downstairs.",
                    "Target": "Study"
                }
            ],
            "BedroomMechanism": true
        },
        "Secret Room": {
            "Body": "<br>The Secret Room: Hidden within the depths of a sprawling, centuries-old mansion lies a secret room, its existence known to only a select few.<br>Accessed through a concealed passage concealed behind a bookcase or beneath a stairwell, the room is a forgotten sanctuary frozen in time.<br>Its walls, adorned with faded tapestries and portraits, bear witness to the passage of ages,<br>while cobwebs cling to forgotten treasures and dust dances in the dim light filtering through stained glass windows.<br>Within this clandestine chamber, whispers of intrigue and mystery linger, hinting at the secrets that lie buried beneath layers of history.",
            "Choices": [
                {
                    "Text": "Play the tape recorder on the table.",
                    "Target": "End"
                }
            ]
        },
        "Kitchen": {
            "Body": "<br>The Kitchen: Decrepit and dim. Curious foods laid out.",
            "Choices": [
                {
                    "Text": "Go left.",
                    "Target": "Dining Hall"
                },
                {
                    "Text": "Go downstairs.",
                    "Target": "Cellar"
                }
            ]
        },
        "Dining Hall": {
            "Body": "<br>The Dining Hall: A grand hall where echoes of past conversations linger.",
            "Choices": [
                {
                    "Text": "Go left.",
                    "Target": "Library"
                },
                {
                    "Text": "Go right.",
                    "Target": "Kitchen"
                }
            ]
        },
        "Garden": {
            "Body": "<br>The Garden: Overgrown and wild, the garden harbors hidden pathways and forgotten statues.",
            "Choices": [
                {
                    "Text": "Take glass door in.",
                    "Target": "Conservatory"
                },
                {
                    "Text": "Follow path back.",
                    "Target": "Foyer"
                }
            ]
        },
        "Cellar": {
            "Body": "<br>The Cellar: Dark and foreboding, the cellar holds secrets best left undisturbed.",
            "Choices": [
                {
                    "Text": "Go upstairs.",
                    "Target": "Kitchen"
                }
            ]
        },
        "End": {
            "Body": "A voice starts:<br><br>As I record this, the weight of sorrow hangs heavy upon my heart, for I recount the tale of our<br>beloved family mansion, now abandoned and left to decay. Once, these halls echoed with laughter<br>and the warmth of kinship, but now they stand silent, haunted by the ghosts of our past. It was not<br>a single tragedy that led to our departure, but a culmination of misfortunes: financial ruin,<br>whispered scandals, and the untimely loss of loved ones. Each brick, each shuttered window bears<br>witness to the gradual unraveling of our once-glorious estate. And so, with heavy hearts and tear-<br>stained memories, we bid farewell to the place we once called home, leaving it to crumble into the<br>annals of time."
        }
    }
}